Revit 2026 API

# TextNoteOptionsRotation Property

---

Base line angle of a text note, in radians.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Rotation { get; set; }
```
```vb
Public Property Rotation As Double
	Get
	Set
```
```cpp
public:
property double Rotation {
	double get ();
	void set (double value);
}
```
```fsharp
member Rotation : float with get, set
```

#### Property Value

Double

Default value is 0.0.

#### Reference

TextNoteOptions Class

Autodesk.Revit.DB Namespace